---
kind: enumMember
id: F:Autodesk.Revit.DB.MaterialPropertyPathType.General
enum: Autodesk.Revit.DB.MaterialPropertyPathType
source: html/38cbac37-6832-2aa2-1922-8bd6b4f2c377.htm
---
# Autodesk.Revit.DB.MaterialPropertyPathType.General

General image, for various material types